micromint/netmf-lpc43xx/MicroFrameworkPK_v4_2/DeviceCode/Targets/Native/LPC43XX/DeviceCode/LPC43XX_USB/LPC43XX_USB.cpp
////////////////////////////////////////////////////////////////////////////////
// LPC43XX_USB.cpp - USB ROM functions for NXP LPC43XX/LPC18XX
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//
// Copyright (c) Microsoft Corporation.  All rights reserved.
// Copyright (c) NXP Semiconductors, 2012
// Ported to NetMF by Micromint USA <support@micromint.com>
////////////////////////////////////////////////////////////////////////////////

#include <tinyhal.h>
#include <pal\com\usb\USB.h>
#include <WireProtocol.h> // for WP_Packet
#include "LPC43XX.h"

// Uses the USB stack in ROM on the LPC4350/30/20 and LPC185x/3x/2x.
// Logic may be portable to other USB stacks (LPCUSBLib/LUFA, RL-USB, etc)
//
// For USB ROM API details, see the corresponding MCU user's manual
// LPC43XX - http://www.nxp.com/documents/user_manual/UM10503.pdf
// LPC18XX - http://www.nxp.com/documents/user_manual/UM10430.pdf
//
#define USE_USB_ROM_STACK  1
//#define USE_USB_CUSTOM
#define USE_USB_PATCH

#include "LPC43XX_USB.h"

// USB interrupt handlers
void USB0_IRQHandler(void* param);
void USB1_IRQHandler(void* param);

static LPC_USBHS_T * const USB_REG_BASE[] = {LPC_USB0, LPC_USB1};
static UINT32 const USB_IRQ[] = {USB0_IRQn, USB1_IRQn};
static HAL_CALLBACK_FPN const USB_ISR[] = {USB0_IRQHandler, USB1_IRQHandler};
//static UINT32 const USB_CLK[] = {CLK_MX_USB0, CLK_MX_USB1};
static UINT32 const USB_CLK[] = {CLK_BASE_USB0, CLK_BASE_USB1};

typedef struct
{
  USBD_HANDLE_T hCore;
  BOOL enabled;
  UINT8 flags;
  USB_CONTROLLER_STATE *pState;
  UINT16 epStatus[USB_MAX_EP_NUM];
  UINT8 prevState;
} USB_CORE_T;

static USB_CORE_T usb_core[MAX_USB_CORE];
static USB_CONTROLLER_STATE usb_ctrl_state[MAX_USB_CORE];
#ifdef USE_USB_PATCH
static USB_EP_HANDLER_T EP0_Default_Handler;
static uint32_t EP0_RX_Busy = 0; // flag indicating whether EP0 OUT/RX buffer is busy
#endif

#define USB_REG(core)      (USB_REG_BASE[core])
#define USB_HANDLE(core)   (usb_core[core].hCore)
#define USB_HCDC(core)     (usb_core[core].hCdc)
#define USB_ENABLED(core)  (usb_core[core].enabled)
#define USB_FLAGS(core)    (usb_core[core].flags)
#define USB_STATE(core)    (usb_core[core].pState)
#define USB_EPSTATUS(core) (usb_core[core].epStatus)
#define USB_PREVSTAT(core) (usb_core[core].prevState)
#define USB_CORE(handle)   ((handle == USB_HANDLE(0)) ? 0 : 1)

Hal_Queue_KnownSize<USB_PACKET64,USB_QUEUE_PACKET_COUNT> QueueBuffers[USB_MAX_EP_NUM];

#define MAX_EP0_SIZE    64  // 64 for HS
// Max bulk transfer size should be <= USB_MAX_DATA_PACKET_SIZE
#define MAX_EP_SIZE     USB_MAX_DATA_PACKET_SIZE  // Bulk transfers

// Initial USB config for USB ROM stack
// ToDo: Get descriptors using USB_FindRecord() to avoid duplicate structs
#include "usbrom_config.cpp"

// ---------------------------------------------------------------------------
// USB buffers and descriptors need to be in AHBSRAM for USB bus master access
#pragma arm section zidata = "SectionForDMA"

#define USBROM_MEM_SIZE (4 * 1024)
#define EP_MEM_SIZE     (1024)

ALIGNED(2048) static UINT8 usbrom_buff[MAX_USB_CORE][USBROM_MEM_SIZE];
// Endpoint buffers
ALIGNED(4) static UINT8 ep_out_data[MAX_USB_CORE][EP_MEM_SIZE];
ALIGNED(4) static UINT8 ep_in_data[MAX_USB_CORE][EP_MEM_SIZE];
ALIGNED(4) static UINT16 ep_out_count[MAX_USB_CORE];
ALIGNED(4) static UINT16 ep_in_count[MAX_USB_CORE];

// Copy of descriptors in AHBSRAM
ALIGNED(4) static UINT8 USBROM_DeviceDescriptor[sizeof(USB_DeviceDescriptor)];
ALIGNED(4) static UINT8 USBROM_ConfigDescriptor[sizeof(USB_ConfigDescriptor)];
ALIGNED(4) static UINT8 USBROM_FSConfigDescriptor[sizeof(USB_FSConfigDescriptor)];
ALIGNED(4) static UINT8 USBROM_StringDescriptor[sizeof(USB_StringDescriptor)];
ALIGNED(4) static UINT8 USBROM_DeviceQualifier[sizeof(USB_DeviceQualifier)];

#pragma arm section zidata

// ---------------------------------------------------------------------------
// Local functions
static ErrorCode_t USB_InitStack(int core);
// USB device event callbacks
static ErrorCode_t USB_Reset_Event_Handler(USBD_HANDLE_T hUsb);
static ErrorCode_t USB_Suspend_Event_Handler(USBD_HANDLE_T hUsb);
static ErrorCode_t USB_Resume_Event_Handler(USBD_HANDLE_T hUsb);
// USB endpoint event callbacks
static ErrorCode_t USB_EP_In_Handler(USBD_HANDLE_T hUsb, void* data, UINT32 event);
static ErrorCode_t USB_EP_Out_Handler(USBD_HANDLE_T hUsb, void* data, UINT32 event);

#ifdef USE_USB_PATCH
ErrorCode_t USB_EP0_Patch(USBD_HANDLE_T hUsb, void* data, UINT32 event);
#endif
#ifdef USE_USB_CUSTOM
ErrorCode_t USB_EP0_Handler(USBD_HANDLE_T hUsb, void* data, UINT32 event);
static ErrorCode_t USB_EP0_Setup(USBD_HANDLE_T hUsb);
static ErrorCode_t USB_EP0_Transmit(USBD_HANDLE_T hUsb, UINT8* data, UINT32 cnt);
#endif

// ---------------------------------------------------------------------------
static ErrorCode_t USB_InitStack(int core)
{
    if (USB_HANDLE(core)) return RET_OK; // Only init once

    USBD_API_INIT_PARAM_T usb_param;
    USB_CORE_DESCS_T core_desc;

    // Initialize USB parameter structure
    memset((void *)&usb_param, 0, sizeof(USBD_API_INIT_PARAM_T));
    // Configure USB memory
    usb_param.usb_reg_base = (UINT32)USB_REG(core);
    usb_param.max_num_ep = USB_MAX_EP_NUM;
    usb_param.mem_base = (UINT32)&usbrom_buff[core];
    usb_param.mem_size = USBROM_MEM_SIZE;
    // Configure USB callbacks
    usb_param.USB_Suspend_Event = USB_Suspend_Event_Handler;
    usb_param.USB_Resume_Event = USB_Resume_Event_Handler;
    usb_param.USB_Reset_Event = USB_Reset_Event_Handler;

    // Configure stack with initial device, configuration and string descriptors
    // ep0 class handler can manage USB dynamic configuration afterwards
    memcpy(USBROM_DeviceDescriptor, USB_DeviceDescriptor, sizeof(USB_DeviceDescriptor));
    memcpy(USBROM_ConfigDescriptor, USB_ConfigDescriptor, sizeof(USB_ConfigDescriptor));
    memcpy(USBROM_FSConfigDescriptor, USB_FSConfigDescriptor, sizeof(USB_FSConfigDescriptor));
    memcpy(USBROM_StringDescriptor, USB_StringDescriptor, sizeof(USB_StringDescriptor));
    memcpy(USBROM_DeviceQualifier, USB_DeviceQualifier, sizeof(USB_DeviceQualifier));

    core_desc.device_desc = (UINT8*)USBROM_DeviceDescriptor;
    core_desc.high_speed_desc = (UINT8*)USBROM_ConfigDescriptor;
    core_desc.full_speed_desc = (UINT8*)USBROM_FSConfigDescriptor;
    core_desc.string_desc = (UINT8*)USBROM_StringDescriptor;
    core_desc.device_qualifier = (UINT8*)USBROM_DeviceQualifier;

