micromint/netmf-lpc43xx/MicroFrameworkPK_v4_2/DeviceCode/Targets/Native/LPC43XX/DeviceCode/LPC43XX_USB/LPC43XX_USB.cpp
    return USBD_Init(&(USB_HANDLE(core)), &core_desc, &usb_param);
}

// ---------------------------------------------------------------------------
static ErrorCode_t USB_Suspend_Event_Handler(USBD_HANDLE_T hUsb)
{
    int core = USB_CORE(hUsb);
    USB_CONTROLLER_STATE *State = USB_STATE(core);

    USB_PREVSTAT(core) = State->DeviceState;
    State->DeviceState = USB_DEVICE_STATE_SUSPENDED;
    USB_StateCallback(State);
    return RET_OK;
}

// ---------------------------------------------------------------------------
static ErrorCode_t USB_Resume_Event_Handler (USBD_HANDLE_T hUsb)
{
    int core = USB_CORE(hUsb);
    USB_CONTROLLER_STATE *State = USB_STATE(core);

    State->DeviceState = USB_PREVSTAT(core);
    USB_PREVSTAT(core) = 0;
    USB_StateCallback(State);
    return RET_OK;
}

// ---------------------------------------------------------------------------
static ErrorCode_t USB_Reset_Event_Handler(USBD_HANDLE_T hUsb)
{
    int core = USB_CORE(hUsb);
    USB_CONTROLLER_STATE *State = USB_STATE(core);

    // Clear all flags
    USB_ClearEvent(0, USB_EVENT_ALL);

    State->FirstGetDescriptor = TRUE;
#ifdef USE_USB_CUSTOM
    State->DeviceState = USB_DEVICE_STATE_DEFAULT;
#endif
    State->Address = 0;
    USB_StateCallback(State);
    USB_FLAGS(core) = 0;

    // Reset endpoints
    USBD_ResetEP(hUsb, USB_ENDPOINT_IN(BULK_IN_EP));
    USBD_ResetEP(hUsb, USB_ENDPOINT_OUT(BULK_OUT_EP));
    ep_out_count[core] = 0;
    ep_in_count[core] = 0;

#ifdef USE_USB_PATCH
    EP0_Default_Handler(hUsb, 0, USB_EVT_IN_STALL);
#endif

    return RET_OK;
}

#ifdef USE_USB_CUSTOM
// ---------------------------------------------------------------------------
// Process requests for control endpoint (ep0)
ErrorCode_t USB_EP0_Handler(USBD_HANDLE_T hUsb, void* data, UINT32 event)
{
    USB_CORE_CTRL_T* pCtrl = (USB_CORE_CTRL_T*)hUsb;

    switch(event)
    {
        case USB_EVT_SETUP:
            // Handle SETUP events
            return USB_EP0_Setup(hUsb);

#if 0
        case USB_EVT_OUT:
        case USB_EVT_OUT_NAK:
            // Handle OUT events (Rx <-- Host OUT)
            if (pCtrl->EP0Data.Count) {	// Data to receive ?
                USBD_DataOutStage(hUsb); // If so, receive data
            }
            if (pCtrl->EP0Data.Count == 0) { // Data complete ?
                // Process data on the buffer
                USBD_StatusInStage(hUsb); // Set state
            }
            return LPC_OK;
            break;
#endif

        case USB_EVT_IN:
            // Handle IN events (Rx --> Host IN)
            if (pCtrl->EP0Data.Count) { // Data to send?
                USBD_DataInStage(hUsb);  // If so, send it
            } else {
                USBD_StatusOutStage(hUsb); // Else set state
            }
            return LPC_OK;
            break;

        default:
            break;
    }

    return RET_UNHANDLED;
}

// ---------------------------------------------------------------------------
// Process setup requests for control endpoint (ep0)
static ErrorCode_t USB_EP0_Setup(USBD_HANDLE_T hUsb)
{
    int core = USB_CORE(hUsb);
    USB_CONTROLLER_STATE *State;
    USB_CORE_CTRL_T* pCtrl = (USB_CORE_CTRL_T*)hUsb;
#if 0    
    USB_SETUP_PACKET Setup;
    BOOL shortDescriptor = FALSE;

    // Setup packet received
    State = USB_STATE(core);
    USBD_ReadSetupPkt(hUsb, USB_ENDPOINT_OUT(0), (UINT32*)&Setup);
    pCtrl->EP0Data.Count = Setup.wLength;

    // Special handling for the very first SETUP command
    // Getdescriptor[DeviceType], the host looks for 8 bytes data only
    if ((Setup.bRequest == USB_GET_DESCRIPTOR)
                && (((Setup.wValue & 0xFF00) >> 8) == USB_DEVICE_DESCRIPTOR_TYPE)
                && (Setup.wLength != 0x12))
            shortDescriptor = TRUE;

    // Send setup packet to upper layer
    State->Data = (UINT8*)&Setup;
    State->DataSize = Setup.wLength; //sizeof(USB_SETUP_PACKET); //?
#else
    USB_SETUP_PACKET* Setup;
    BOOL shortDescriptor = FALSE;

    // Setup packet received
    State = USB_STATE(core);
    Setup = (USB_SETUP_PACKET*)&pCtrl->SetupPacket;

    // Special handling for the very first SETUP command
    // Getdescriptor[DeviceType], the host looks for 8 bytes data only
    if ((Setup->bRequest == USB_GET_DESCRIPTOR)
                && (((Setup->wValue & 0xFF00) >> 8) == USB_DEVICE_DESCRIPTOR_TYPE)
                && (Setup->wLength != 0x12))
            shortDescriptor = TRUE;

    // Send setup packet to upper layer
    State->Data = (UINT8*)Setup;
    State->DataSize = sizeof(USB_SETUP_PACKET); //?
#endif
    UINT8 result = USB_ControlCallback(State);

    switch(result)
    {
        case USB_STATE_DATA:
            // Setup packet was handled and the upper layer has data to send
            break;

        case USB_STATE_ADDRESS:
            // Upper layer needs us to change the address 
            //USBD_SetAddress(hUsb, State->Address); // Handled by USB stack
            return RET_UNHANDLED; // Let USB stack do it

        case USB_STATE_DONE:
            State->DataCallback = NULL;
            break;

        case USB_STATE_STALL:
            // setup packet failed to process successfully
            // set stall condition on the default control endpoint           
            //USBD_SetStallEP(hUsb, 0); // Handled by USB stack
            return RET_UNHANDLED; // Let USB stack do it

        case USB_STATE_STATUS:
            // Handled by USB stack
            break;

        case USB_STATE_CONFIGURATION:
            break;

        case USB_STATE_REMOTE_WAKEUP:
            // It is not using currently as the device side won't go into SUSPEND mode unless
            // the PC is purposely to select it to SUSPEND, as there is always SOF in the bus
            // to keeping the device from SUSPEND.
            break;

        default:
            ASSERT(0);
            break;
            // Status change is only handled by USB stack
    }
            
    if (result != USB_STATE_STALL)
    {
        if (State->DataCallback)
        {
            // This call can't fail
            State->DataCallback(State);

            if (State->DataSize > 0)
            {
                UINT32 cnt = (shortDescriptor ? 8 : State->DataSize);

                USB_EP0_Transmit(hUsb, State->Data, cnt);

                // Special handling the USB driver set address test, cannot use 
                // first descriptor as ADDRESS state if handle is in hardware
                if (shortDescriptor) State->DataCallback = NULL;
            }
        }
    }

