micromint/netmf-lpc43xx/MicroFrameworkPK_v4_2/DeviceCode/Targets/Native/LPC43XX/DeviceCode/LPC43XX_USB/LPC43XX_USB.cpp
    // If port is now configured, output any queued data
    if (result == USB_STATE_CONFIGURATION)
    {
        for (int epNum = 1; epNum < State->EndpointCount; epNum++ )
        {
            if (State->Queues[epNum] && State->IsTxQueue[epNum])
                CPU_USB_StartOutput(State, epNum);
        }
    }
    return RET_OK;
}

static ErrorCode_t USB_EP0_Transmit(USBD_HANDLE_T hUsb, UINT8* data, UINT32 cnt)
{
    USB_CORE_CTRL_T* pCtrl = (USB_CORE_CTRL_T*)hUsb;

    pCtrl->EP0Data.pData = data;
    pCtrl->EP0Data.Count = cnt;
    USBD_DataInStage(hUsb);

    return RET_OK;
}
#endif // USE_USB_CUSTOM

// ---------------------------------------------------------------------------
// Receive buffer when handling data endpoint OUT event (Rx <-- Host OUT)
static ErrorCode_t USB_EP_Out_Handler(USBD_HANDLE_T hUsb, void* data, UINT32 event)
{
    int epNum = (int)data;
    int core = USB_CORE(hUsb);
    USB_PACKET64* Packet64;
    USB_CONTROLLER_STATE *State = USB_STATE(core);
    BOOL full;
    UINT32 len;

    // Handle OUT events
    if (State->Queues[epNum] == NULL || State->IsTxQueue[epNum])
        return RET_UNHANDLED;

    switch(event)
    {
        case USB_EVT_OUT_NAK:
            // If we are ready to receive data, send buffer pointer to USB stack
            USBD_ReadReqEP(hUsb, USB_ENDPOINT_OUT(epNum), ep_out_data[core], MAX_EP_SIZE);
            break;

        case USB_EVT_OUT:
            // Read data received via DMA
            len = USBD_ReadEP(hUsb, USB_ENDPOINT_OUT(epNum), ep_out_data[core]) & 0xFFFF;
            if (len > 0)
            {
                // The DMA transfer is complete. Process buffer.
                Packet64 = USB_RxEnqueue(State, epNum, full);
                if (Packet64 != NULL)
                {
                    Packet64->Size = len;
                    memcpy(Packet64->Buffer, ep_out_data[core], Packet64->Size);
                    Events_Set(SYSTEM_EVENT_FLAG_USB_IN);
                }
                //if (full) USBD_DisableEP(hUsb, USB_ENDPOINT_OUT(epNum));
            }
            break;

        default:
            return RET_UNHANDLED;
    }

    return RET_OK;
}

// ---------------------------------------------------------------------------
// Transmit buffer when handling data endpoint IN event (Tx -> Host IN)
static ErrorCode_t USB_EP_In_Handler(USBD_HANDLE_T hUsb, void* data, UINT32 event)
{
    // Exit if not an IN event
    if (event != USB_EVT_IN) return RET_UNHANDLED;

    int epNum = (int)data;
    int core = USB_CORE(hUsb);

    // Exit if buffer empty
    if (ep_in_count[core] == 0) return RET_UNHANDLED;

    // Send buffer
    USBD_WriteEP(hUsb, USB_ENDPOINT_IN(epNum), ep_in_data[core], ep_in_count[core]);
    ep_in_count[core] = 0;

    return RET_OK;
}

// ---------------------------------------------------------------------------
void USB0_IRQHandler(void* param)
{
    USBD_ISR(USB_HANDLE(0));
}

// ---------------------------------------------------------------------------
void USB1_IRQHandler(void* param)
{
    USBD_ISR(USB_HANDLE(1));
}

#ifdef USE_USB_PATCH
// ---------------------------------------------------------------------------
ErrorCode_t USB_EP0_Patch(USBD_HANDLE_T hUsb, void* data, UINT32 event)
{
    switch (event) {
        case USB_EVT_OUT_NAK:
            if (EP0_RX_Busy) {
                // we already queued the buffer so ignore this NAK event
                return LPC_OK;
            } else {
                // Mark EP0_RX buffer as busy and allow base handler to queue the buffer
                EP0_RX_Busy = 1;
            }
            break;
        case USB_EVT_SETUP: // reset the flag when new setup sequence starts
        case USB_EVT_OUT:
            // we received the packet so clear the flag
            EP0_RX_Busy = 0;
            break;
    }
    return EP0_Default_Handler(hUsb, data, event);
}
#endif

// ---------------------------------------------------------------------------
HRESULT CPU_USB_Initialize(int core)
{
    if (core >= MAX_USB_CORE || USB_ENABLED(core)) return S_FALSE;

    USB_CONTROLLER_STATE *State = CPU_USB_GetState(core);
    const USB_ENDPOINT_DESCRIPTOR  *pEpDesc;
    const USB_INTERFACE_DESCRIPTOR *pIfDesc;
    int epNum, ret;
    UINT32 queueId = 0;

    GLOBAL_LOCK(irq);

    // Initialize physical layer
    if (!USB_ENABLED(1 - core))  // No other USB controllers enabled?
    {
        LPC_CGU->PLL[CGU_USB_PLL].PLL_CTRL &= ~1; // Enable USB PLL
        while (!(LPC_CGU->PLL[CGU_USB_PLL].PLL_STAT & 1)); // Wait for USB PLL to lock
    }
    LPC_CGU->BASE_CLK[USB_CLK[core]] &= ~1;  // Enable USBx base clock
    LPC_CREG->CREG0 &= ~(1 << 5); // Enable USB0 PHY
    if (core == 1) // Special init for USB1
    {
        // Enable USB1_DP and USB1_DN on chip FS phy
        LPC_SCU->SFSUSB = 0x12; // USB device mode (0x16 for host mode)
        LPC_USB1->PORTSC1_D |= (1 << 24);
    }

    // Set USB state
    USB_STATE(core) = State;
    USB_FLAGS(core) = 0;
    ep_out_count[core] = 0;
    ep_in_count[core] = 0;

    State->EndpointStatus = USB_EPSTATUS(core);
    State->EndpointCount = USB_MAX_EP_NUM;
    State->PacketSize = MAX_EP0_SIZE;

    // Initialize USB stack
    ret = USB_InitStack(core);
    if (ret != RET_OK) return S_FALSE; // Exit if not succesful
    USBD_HANDLE_T hUsb = USB_HANDLE(core);
#ifdef USE_USB_PATCH
    // Register EP0 patch
    USB_CORE_CTRL_T* pCtrl = (USB_CORE_CTRL_T*)hUsb; // Convert the handle to control structure
    EP0_Default_Handler = pCtrl->ep_event_hdlr[0]; // Retrieve the default EP0_OUT handler
    pCtrl->ep_event_hdlr[0] = USB_EP0_Patch; // Set our patch routine as EP0_OUT handler
#endif
#ifdef USE_USB_CUSTOM
    // Register EP0 class handler
    USBD_RegisterClassHandler(*phUsb, USB_EP0_Handler, NULL);
#endif

    // Set defaults for unused endpoints
    for (epNum = 1; epNum < State->EndpointCount; epNum++)
    {
        State->IsTxQueue[epNum] = FALSE;
        State->MaxPacketSize[epNum] = MAX_EP_SIZE;
    }

    // Get endpoint configuration
    while (USB_NextEndpoint(State, pEpDesc, pIfDesc))
    {
        // Figure out which endpoint we are initializing
        epNum = pEpDesc->bEndpointAddress & 0x7F;

        // Check interface and endpoint numbers against hardware capability
        if (epNum >= State->EndpointCount || pIfDesc->bInterfaceNumber > 3)
            return S_FALSE;

        if (pEpDesc->bEndpointAddress & 0x80) State->IsTxQueue[epNum] = TRUE;

